In [300]:
import pandas as pd 
import numpy as np 
import warnings
warnings.filterwarnings('ignore')

In [301]:
data = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [302]:
data.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [303]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [304]:
#lets check the missing values
data.isnull().sum()

From_To         0
FlightNumber    2
RecentDelays    0
Airline         0
dtype: int64

1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column)

In [305]:
data[data['FlightNumber'].isnull()]

          From_To  FlightNumber RecentDelays            Airline
1    MAdrid_miLAN           NaN           []  <Air France> (12)
3  Budapest_PaRis           NaN         [13]     12. Air France

In [306]:
x = data.iloc[1].fillna(10055)

In [307]:
y = data.iloc[3].fillna(10075)

In [308]:
data.iloc[1] = data.iloc[1].fillna(x)

In [309]:
data.iloc[3] = data.iloc[3].fillna(y)

In [310]:
data.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [311]:
data['FlightNumber'] = data['FlightNumber'].astype(int)

In [312]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int32
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int32(1), object(3)
memory usage: 268.0+ bytes

2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame

In [313]:
data['From_To'] = data['From_To'].str.split('_')

In [314]:
data['From_To'].head()

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: From_To, dtype: object

In [315]:
data['From'] = data['From_To'].apply(lambda x : x[0])

In [316]:
data['To'] = data['From_To'].apply(lambda x : x[1])

In [317]:
data['From']

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From, dtype: object

In [318]:
data['To']

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: To, dtype: object

In [319]:
data.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,"[LoNDon, paris]",10045,"[23, 47]",KLM(!),LoNDon,paris
1,"[MAdrid, miLAN]",10055,[],<Air France> (12),MAdrid,miLAN
2,"[londON, StockhOlm]",10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,"[Budapest, PaRis]",10075,[13],12. Air France,Budapest,PaRis
4,"[Brussels, londOn]",10085,"[67, 32]","""Swiss Air""",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [320]:
data['From'] = data['From'].str.capitalize()
data['To'] = data['To'].str.capitalize()

In [321]:
data[['From','To']]

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [322]:
data.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,"[LoNDon, paris]",10045,"[23, 47]",KLM(!),London,Paris
1,"[MAdrid, miLAN]",10055,[],<Air France> (12),Madrid,Milan
2,"[londON, StockhOlm]",10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,"[Budapest, PaRis]",10075,[13],12. Air France,Budapest,Paris
4,"[Brussels, londOn]",10085,"[67, 32]","""Swiss Air""",Brussels,London

In [323]:
data.drop('From_To',axis = 1,inplace = True)

In [324]:
data.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [325]:
#lets arrange them in order wise
data = pd.DataFrame(data,columns = ['From','To','FlightNumber','RecentDelays','Airline'])

In [326]:
data

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [327]:
delays = pd.DataFrame(data['RecentDelays'].to_list(),columns = ['delay_1','delay_2','delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [328]:
data.drop('RecentDelays',axis = 1,inplace = True)

In [329]:
data.head()

       From         To  FlightNumber              Airline
0    London      Paris         10045               KLM(!)
1    Madrid      Milan         10055    <Air France> (12)
2    London  Stockholm         10065  (British Airways. )
3  Budapest      Paris         10075       12. Air France
4  Brussels     London         10085          "Swiss Air"

In [330]:
data.insert(loc = 3,column = 'delay_1',value = delays['delay_1'])
data.insert(loc = 4,column = 'delay_2',value = delays['delay_2'])
data.insert(loc = 5,column = 'delay_3',value = delays['delay_3'])

In [331]:
data.head()

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,"""Swiss Air"""